# constants.py

WEEKDAYS_RU = {
    0: "Понедельник",
    1: "Вторник",
    2: "Среда",
    3: "Четверг",
    4: "Пятница",
    5: "Суббота",
    6: "Воскресенье",
}

MONTHS_RU = {
    1: "января",
    2: "февраля",
    3: "марта",
    4: "апреля",
    5: "мая",
    6: "июня",
    7: "июля",
    8: "августа",
    9: "сентября",
    10: "октября",
    11: "ноября",
    12: "декабря",
}

BUILDINGS = {
    "1": "Учебное здание №1 — ул. Четаева, 18",
    "2": "Учебное здание №2 — ул. Большая Красная, 55",
    "3": "Учебное здание №3 — ул. Карла Маркса, 10",
    "4": "Учебное здание №4 — ул. Товарищеская, 30",
    "5": "Учебное здание №4 — ул. Товарищеская, 30",
    "6": "Учебное здание №4 — ул. Товарищеская, 30",
    "7": "Учебное здание №4 — ул. Товарищеская, 30",
    "8": "Учебное здание №4 — ул. Товарищеская, 30"
}

DORMS = {
    "1": "Общежитие №1 — ул. Четаева, 16",
    "2": "Общежитие №2 — ул. Четаева, 14",
    "3": "Общежитие №3 — ул. Четаева, 12",
    "4": "Общежитие №3 — ул. Четаева, 12",
    "5": "Общежитие №3 — ул. Четаева, 12",
    "6": "Общежитие №3 — ул. Четаева, 12",
    "7": "Общежитие №3 — ул. Четаева, 12",
    "8": "Общежитие №3 — ул. Четаева, 12"
}
